// logo
// Автопроверка домашних заданий по JavaScript

// Задача 3 / 36
// Модуль: 
// 1


// Скрыть задание
// Обратная связь
// ↔
// Типы примитивов (числа, строки, були)
// В JavaScript переменная не ассоциируется с каким-либо типом данных, тип есть у её значения. То есть переменная может хранить значения разных типов.

// Number - целые числа и числа с плавающей запятой (точкой).
// String - строки, последовательность из нуля или более символов. Строка начинается и заканчивается одиночной ' или двойными кавычками ".
// Boolean - логический тип данных, флаги состояния. Всего два значения: true и false. Например, на вопрос включен ли свет в комнате можно ответить да (true) или нет (false).
// // Числа
// const age = 20;
// const salary = 3710.84;

// // Строки
// const name = 'Манго';
// const description = 'JavaSript для начинающих';

// // Були
// const isModalOpen = true;
// const isLoggedIn = false;
// Задание
// Объяви следующие переменные используя ключевое слово const или let и присвой им соответствующие значения.

// topSpeed - число 160.
// distance - число 617.54.
// login - строка 'mango935'.
// isOnline - буль true.
// isAdmin - буль false.
// Тесты
// Объявлена переменная topSpeed.
// Значение переменной topSpeed это число 160.
// Объявлена переменная distance.
// Значение переменной distance это число 617.54.
// Объявлена переменная login.
// Значение переменной login это строка 'mango935'.
// Объявлена переменная isOnline.
// Значение переменной isOnline это буль true.
// Объявлена переменная isAdmin.
// Значение переменной isAdmin это буль false.
// Редактор JavaScript:
// 1
// ​
// Проверить
// Сбросить
// Скрыть секцию результатов
// Результаты:
// (обновляются при нажатии на кнопку - Проверить)

// ©
// 2020
// |
// Политика конфиденциальности


let topSpeed = 160;
let distance = 617.54;
let login = 'mango935';
let isOnline = true;
let isAdmin = false;
console.log(`
topSpeed ${topSpeed}
distance ${distance}
login ${login}
isOnline ${isOnline}
isAdmin ${isAdmin}
`)