// for (let i = 1; i <= 9; i += 1) {
//   console.log(`<!-- <script src="./js/hw-01/01-0${i}___-.js" type="module"></script> -->`);

// }

// for (let i = 10; i <= 36; i += 1) {
//   console.log(`<!-- <script src="./js/hw-01/01-${i}___-.js" type="module"></script> -->`);

// }

// logo
// Автопроверка домашних заданий по JavaScript
// Задача 1 / 36
// Модуль: 
// 1


// Скрыть задание
// Обратная связь
// ↔
// Объявление переменных
// Переменные используются для хранения данных и состоят из идентификатора (имени) и области в памяти, где хранится их значение. Переменную можно представить как коробку с надписью (именем), в которой что-то лежит (значение).

// <ключевое слово> <имя переменной> = <значение>
// Объявление переменной начинается с ключевого слова const. Такая переменная должна быть сразу инициализирована значением, после чего его нельзя переопределить.

// Внимание
// Создание переменной без ключевого слова const приведёт к ошибке.

// const age = 20;
// const userName = 'Манго';
// const socialProfileTag = '@gluck';
// const totalWorkerSalary = 4052;
// В JavaScript имя перенной записывается в camelCase-нотации. Первое слово пишется строчными буквами, а каждое последующее начинается с заглавной. Имена чувствительны к регистру, то есть переменные user, usEr и User различны.

// Задание
// Объяви две переменные, productName для названия товара и pricePerItem для хранения цены за штуку. При объявлении присвой переменным следующие характеристики товара:

// название - строка 'Droid';
// цена за штуку - число 2000.
// Тесты
// Объявлена переменная productName.
// Значение переменной productName это строка 'Droid'.
// Объявлена переменная pricePerItem.
// Значение переменной pricePerItem это число 2000.
// Редактор JavaScript:
// 1
// // Write your code under this line
// 2
// ​
// 3
// ​
// 4
  
// 5
// // console.log(productName);
// 6
// // 'Droid'
// 7
// ​
// 8
// // console.log(pricePerItem);
// 9
// // 2000
// Проверить
// Сбросить
// Скрыть секцию результатов
// Результаты:
// (обновляются при нажатии на кнопку - Проверить)

// ©
// 2020
// |
// Политика конфиденциальности

// Write your code under this line
const productName = 'Droid';
const pricePerItem = 2000;
// console.log(productName, pricePerItem);
console.log(productName);
// 'Droid'

console.log(pricePerItem);
// 2000