// logo
// Автопроверка домашних заданий по JavaScript

// Задача 36 / 41
// Модуль:
// 3

// Скрыть задание
// Обратная связь
// ↔
// Задача. Лавка зелий «У старой жабы»
// Задание
// К нам обратилась владелица лавки зелий «У старой жабы» и заказала программу для ведения инвентаря - добавления, удаления, поиска и обновления зелий. Добавь объекту atTheOldToad свойство potions, значением которого сделай пустой массив.

// Тесты
// Объявлена переменная atTheOldToad.
// Значение переменной atTheOldToad это объект.
// Значение свойства atTheOldToad.potions это массив [].
// Редактор JavaScript:
// 1
// const atTheOldToad = {
// 2
//   // Пиши код ниже этой строки
// 3
//   // Пиши код выше этой строки
// 4
// };
// 5
// ​
// Проверить
// Сбросить
// Скрыть секцию результатов
// Результаты:
// (обновляются при нажатии на кнопку - Проверить)

// ©
// 2020
// |
// Политика конфиденциальности

const atTheOldToad = {
  // Пиши код ниже этой строки
  potions: [],
  // Пиши код выше этой строки
};
