// logo
// Автопроверка домашних заданий по JavaScript

// Задача 7 / 32
// Модуль: 
// 2


// Скрыть задание
// Обратная связь
// ↔
// Длина массива
// Длина массива, то есть число его элементов, хранится в свойстве length. Это динамическая величина, которая изменяется автоматически при добавлении или удалении элементов.

// const planets = ['Земля', 'Марс', 'Венера'];
// console.log(planets.length); // 3
// Задание
// Объяви переменную fruitsArrayLength и присвой ей длину массива fruits используя свойство length.

// Тесты
// Объявлена переменная fruitsArrayLength.
// Значение переменной fruitsArrayLength это число 4.
// Редактор JavaScript:
// 1
// // Стартовый код
// 2
// const fruits = ['яблоко', 'персик', 'груша', 'банан'];
// 3
// // Пиши код ниже этой строки
// Проверить
// Сбросить
// Скрыть секцию результатов
// Результаты:
// (обновляются при нажатии на кнопку - Проверить)

// ©
// 2020
// |
// Политика конфиденциальности


// Стартовый код
const fruits = ['яблоко', 'персик', 'груша', 'банан'];
const fruitsArrayLength = fruits.length;
// Пиши код ниже этой строки