// logo
// Автопроверка домашних заданий по JavaScript

// Задача 9 / 32
// Модуль: 
// 2


// Скрыть задание
// Обратная связь
// ↔
// Крайние элементы массива
// Задание
// Напиши функцию getExtremeElements(array) которая принимает один параметр array - массив элементов произвольной длины. Функция должна возвращать массив из двух элементов - первого и последнего элемента параметра array.

// Тесты
// Объявлена функция getExtremeElements(array).
// Вызов getExtremeElements([1, 2, 3, 4, 5]) возвращает [1, 5].
// Вызов getExtremeElements(['Земля', 'Марс', 'Венера']) возвращает ['Земля', 'Венера'].
// Вызов getExtremeElements(['яблоко', 'персик', 'груша', 'банан']) возвращает ['яблоко', 'банан'].
// Редактор JavaScript:
// 1
// function getExtremeElements(array) {
// 2
//     // Пиши код ниже этой строки
// 3
    
// 4
// ​
// 5
// ​
// 6
// ​
// 7
//     // Пиши код выше этой строки
// 8
//   }
// Проверить
// Сбросить
// Скрыть секцию результатов
// Результаты:
// (обновляются при нажатии на кнопку - Проверить)

// ©
// 2020
// |
// Политика конфиденциальности


function getExtremeElements(array) {
    // Пиши код ниже этой строки
    
  return [array[0], array[array.length - 1]];


    // Пиши код выше этой строки
}
  
