// logo
// Автопроверка домашних заданий по JavaScript

// Задача 4 / 32
// Модуль: 
// 2


// Скрыть задание
// Обратная связь
// ↔
// Создание массива
// Массив используется для хранения упорядоченной коллекции элементов. Он объявляется открывающей и закрывающей квадратной скобками [] - литералом массива. Внутри скобок каждый элемент массива разделяется запятой.

// const planets = ['Земля', 'Марс', 'Венера'];
// Полезно
// При объявлении переменной для объекта или массива программисты обычно используют const. Они делают это для того, чтобы случайно не перезаписать значение, т.к. попытка перезаписи вызовет ошибку до того как код попадет к пользователю.

// Задание
// Объяви переменную fruits и присвой ей массив фруктов - строк 'яблоко', 'слива', 'груша' и 'апельсин'.

// Тесты
// Объявлена переменная fruits.
// Значение переменной fruits это массив ['яблоко', 'слива', 'груша', 'апельсин'].
// Редактор JavaScript:
// 1
// // Пиши код ниже этой строки
// 2
// ​
// 3
// ​
// Проверить
// Сбросить
// Скрыть секцию результатов
// Результаты:
// (обновляются при нажатии на кнопку - Проверить)

// ©
// 2020
// |
// Политика конфиденциальности



const fruits = ['яблоко', 'слива', 'груша', 'апельсин'];