// // logo
// // Автопроверка домашних заданий по JavaScript

// // Задача 15 / 32
// // Модуль: 
// // 2


// // Скрыть задание
// // Обратная связь
// // ↔
// // Метод concat()
// // Метод concat используется для объединения двух или более массивов. Он не изменяет массив на котором вызывается, а возвращает новый. Порядок аргументов метода влияет на порядок элементов нового массива.

// // const firstArray = ['Меркурий', 'Венера', 'Земля'];
// // const secondArray = ['Марс', 'Юпитер'];
// // const thirdArray = ['Сатурн', 'Уран', 'Нептун'];
// // const allPlanets = firstArray.concat(secondArray, thirdArray);

// // console.log(firstArray); // ['Меркурий', 'Венера', 'Земля'];
// // console.log(allPlanets); // ['Меркурий', 'Венера', 'Земля', 'Марс', 'Юпитер', 'Сатурн', 'Уран', 'Нептун'];
// // Задание
// // Дополни код так, чтобы в переменной allClients получился массив всех элементов массивов oldClients и newClients.

// // Тесты
// // Объявлена переменная oldClients.
// // Значение переменной oldClients это массив ['Манго', 'Аякс', 'Поли', 'Киви'].
// // Объявлена переменная newClients.
// // Значение переменной newClients это массив ['Персик', 'Хьюстон'].
// // Объявлена переменная allClients.
// // Значение переменной allClients это массив ['Манго', 'Аякс', 'Поли', 'Киви', 'Персик', 'Хьюстон'].
// // Переменной allClients присвоен массив после применения метода concat с правильными аргументами.
// // Редактор JavaScript:
// // 1
// // const oldClients = ['Манго', 'Аякс', 'Поли', 'Киви'];
// // 2
// // const newClients = ['Персик', 'Хьюстон'];
// // 3
// // ​
// // 4
// // const allClients = ; // Дополни эту строку
// // Проверить
// // Сбросить
// // Скрыть секцию результатов
// // Результаты:
// // (обновляются при нажатии на кнопку - Проверить)

// // ©
// // 2020
// // |
// // Политика конфиденциальности


// const oldClients = ['Манго', 'Аякс', 'Поли', 'Киви'];
// const newClients = ['Персик', 'Хьюстон'];

// const allClients = ; // Дополни эту строку

const oldClients = ['Манго', 'Аякс', 'Поли', 'Киви'];
const newClients = ['Персик', 'Хьюстон'];

const allClients = oldClients.concat(newClients); // Дополни эту строку