// logo
// Автопроверка домашних заданий по JavaScript

// Задача 17 / 44
// Модуль:
// 6

// Скрыть задание
// Обратная связь
// ↔
// Метод filter() и массив объектов
// При работе с массивом объектов выполняется фильтрация по значению какого-то свойства. В результате получается новый массив отфильтрованных объектов.

// Например, есть массив студентов с баллами за тест. Необходимо отфильтровать лучших (балл выше 80), худших (балл ниже 50) и средних студентов (балл от 50 до 80).

// const LOW_SCORE = 50;
// const HIGH_SCORE = 80;
// const students = [
//   { name: 'Манго', score: 83 },
//   { name: 'Поли', score: 59 },
//   { name: 'Аякс', score: 37 },
//   { name: 'Киви', score: 94 },
//   { name: 'Хьюстон', score: 64 },
// ];

// const best = students.filter((student) => student.score >= HIGH_SCORE);
// console.log(best); // Массив объектов с именами Манго и Киви

// const worst = students.filter((student) => student.score < LOW_SCORE);
// console.log(worst); // Массив с одним объектом Аякс

// // В коллбек-функции удобно деструктуризировать свойства объекта
// const average = students.filter(
//   ({ score }) => score >= LOW_SCORE && score < HIGH_SCORE
// );
// console.log(average); // Массив объектов с именами Поли и Хьюстон
// Задание
// Используя метод filter() дополни код так, чтобы:

// В переменной topRatedBooks получился массив книг рейтинг которых (свойство rating) больше либо равно значению переменной MIN_RATING.
// В переменной booksByAuthor получился массив книг написанных автором с именем (свойство author) которое совпадает со значением в переменной AUTHOR.
// Тесты
// Объявлена переменная books.
// Значение переменной books это массив объектов.
// Объявлена переменная MIN_RATING.
// Значение переменной MIN_RATING это число 8.
// Объявлена переменная AUTHOR.
// Значение переменной AUTHOR это строка 'Бернард Корнуэлл'.
// Объявлена переменная topRatedBooks.
// Значение переменной topRatedBooks это массив книг с рейтингов выше 8.
// Объявлена переменная booksByAuthor.
// Значение переменной booksByAuthor это массив книг автор которых 'Бернард Корнуэлл'.
// Для перебора массива books использован метод filter().
// Редактор JavaScript:
// 1
// const books = [
// 2
//   { title: 'Последнее королевство', author: 'Бернард Корнуэлл', rating: 8.38 },
// 3
//   { title: 'На берегу спокойных вод', author: 'Роберт Шекли', rating: 8.51 },
// 4
//   { title: 'Сон смешного человека', author: 'Федор Достоевский', rating: 7.75 },
// 5
//   { title: 'Красна как кровь', author: 'Ли Танит', rating: 7.94 },
// 6
//   { title: 'Враг Божий', author: 'Бернард Корнуэлл', rating: 8.67 }
// 7
// ];
// 8
// ​
// 9
// const MIN_RATING = 8;
// 10
// const AUTHOR = 'Бернард Корнуэлл';
// 11
// // Пиши код ниже этой строки
// 12
// ​
// 13
// const topRatedBooks = books;
// 14
// const booksByAuthor = books;
// Проверить
// Сбросить
// Скрыть секцию результатов
// Результаты:
// (обновляются при нажатии на кнопку - Проверить)

// ©
// 2020
// |
// Политика конфиденциальности

const books = [
  { title: 'Последнее королевство', author: 'Бернард Корнуэлл', rating: 8.38 },
  { title: 'На берегу спокойных вод', author: 'Роберт Шекли', rating: 8.51 },
  { title: 'Сон смешного человека', author: 'Федор Достоевский', rating: 7.75 },
  { title: 'Красна как кровь', author: 'Ли Танит', rating: 7.94 },
  { title: 'Враг Божий', author: 'Бернард Корнуэлл', rating: 8.67 },
];

const MIN_RATING = 8;
const AUTHOR = 'Бернард Корнуэлл';
// Пиши код ниже этой строки

const topRatedBooks = books.filter(({ rating }) => rating >= MIN_RATING);
console.log('🚀 ~ topRatedBooks', topRatedBooks);
const booksByAuthor = books.filter(({ author }) => author === AUTHOR);
console.log('🚀 ~ booksByAuthor', booksByAuthor);
